In [1]:
import numpy as np
import pandas as pd

##### Creation Date:
##### January 30 2022
##### Created By Alperen KOLAMUC

#### Data

In [2]:
df = pd.read_csv("student.csv")

In [3]:
df

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216

#### Belirli Bir Sütuna Göre Sıralama

In [4]:
df.sort_values(by="age")

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
3      Fırat  Aydınus   42     216
2      Sinan    Engin   48     105

In [5]:
df.sort_values(by="number")

        name lastName  age  number
2      Sinan    Engin   48     105
3      Fırat  Aydınus   42     216
1  Cristiano  Ronaldo   35     303
0    Alperen  Kolamuc   18     401

In [7]:
# Büyükten küçüğe sıralamak için
df.sort_values(by="number", ascending=False)

        name lastName  age  number
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303
3      Fırat  Aydınus   42     216
2      Sinan    Engin   48     105

* String'lerde de alfabetik sıralama yapabiliriz

In [12]:
df.sort_values(by="lastName")

        name lastName  age  number
3      Fırat  Aydınus   42     216
2      Sinan    Engin   48     105
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303

#### Birden Fazla Sütuna Göre Sıralarken Birine Göre Artan Birine Göre Azalan Şekilde Sıralamak

In [14]:
df.sort_values(by=["lastName", "name"], ascending=[True, False])

        name lastName  age  number
3      Fırat  Aydınus   42     216
2      Sinan    Engin   48     105
0    Alperen  Kolamuc   18     401
1  Cristiano  Ronaldo   35     303

#### Series Objelerini Sıralamak

In [15]:
df["name"]

0      Alperen
1    Cristiano
2        Sinan
3        Fırat
Name: name, dtype: object

In [16]:
df["name"].sort_values()

0      Alperen
1    Cristiano
3        Fırat
2        Sinan
Name: name, dtype: object